#+TITLE: refactoring

* RootLink

- [[file:201022-1143-zettelkasten.org]]

* 

orgmode만 잘 사용해도 생각을 나열하는데 아무런 문제가 없다. 마크다운이 좋은지 아니면 이게 좋은지는 모르겠지만..

아무튼간에 생각을 모으는데 이것만한게 없는것은 확실 하다. 

#+begin_src emacs-lisp
(+ 1 2)
#+end_src

#+RESULTS:
: 3

- [[file:scala/trait.org]]

devonthink를 통해서 생각을 정리해도 되고 내가 생각을 어떤걸 가지고 있는지도 정리해도 좋을것 같다.

orgmode와 deft가 있으면 생산적인 글쓰기를 할 수 있다. 이렇게 되는 메모가 얼마나 즐거운가? 아주 간단한 html로 작성하는 행복한 시간 

핵심으 ㄴ
